УТ_для_edt.РасширениеСмарт/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="cdcaa357-6a5c-4e3e-9bcc-7d3bd1aa886a">
    <name>смартСтатусПроверкиОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Безразмерная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/СерииНоменклатуры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	////Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 27.01.2021 14:09:57 задача 444 (код и реквизит по задаче удалены 25.11.2022)
	
	//++ #1250 смарт: Фролов 16.11.2022 //Проверенное оборудование. "Запрет на отгрузку без проверки оборудования  #1143 "  
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ДвиженияСерийТоваровОбороты.Номенклатура КАК Номенклатура,
				|	ДвиженияСерийТоваровОбороты.Характеристика КАК Характеристика
				|ИЗ
				|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(, , , Серия = &Серия) КАК ДвиженияСерийТоваровОбороты
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				|		ПО ДвиженияСерийТоваровОбороты.Номенклатура = НоменклатураСегмента.Номенклатура
				|			И ДвиженияСерийТоваровОбороты.Характеристика = НоменклатураСегмента.Характеристика
				|ГДЕ
				|	НоменклатураСегмента.Сегмент = &Сегмент");
	Запрос.УстановитьПараметр("Серия",Объект.Ссылка);
	Запрос.УстановитьПараметр("Сегмент",Справочники.смартПредопределенныеЗначения.СегментПроверкаОборудования.Значение);
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НовыйЭлемент = Элементы.Вставить("смартСтатусПроверкиОборудования", Тип("ПолеФормы"), Элементы.ГруппаШапка, );
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок="Статус проверки оборудования";
		НовыйЭлемент.ПутьКДанным = "Объект.смартСтатусПроверкиОборудования";   
		НовыйЭлемент.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРазрешитьРедактированиеСерииПредПродПодготовка");
		
	КонецЕсли;
	//-- #1250 смарт: Фролов 16.11.2022
	
	//++ #Б1140 смарт: Шляпников 02.09.2025 / Учет данных по упаковочным листам.
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартДанныеУпаковочногоЛистаИзменены", смартФормированиеИнтерфейса.ОписаниеТипаБулево());
	смартФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, "смартНоменклатураПараметровВесаБрутто", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Если Объект.ВидНоменклатуры = ВидНоменклатурыПлоттеры() Тогда
		
		смартФормированиеИнтерфейса.СздГруппаОбычная(ЭтаФорма, "смартГруппаДанныеУпаковочногоЛиста",, "Данные упаковочного листа", 1);
		
		СтруктураКолонок = Новый Структура;
		СтруктураКолонок.Вставить("ТипУпаковки", "Тип упаковки");
		СтруктураКолонок.Вставить("Длина", "Длина, м");
		СтруктураКолонок.Вставить("Ширина", "Ширина, м");
		СтруктураКолонок.Вставить("Высота", "Высота, м");
		СтруктураКолонок.Вставить("Вес", "Вес, кг");
		СтруктураКолонок.Вставить("Объем", "Объем, м3");
		СтруктураКолонок.Вставить("Хрупкое", "Хрупкое");
		
		События = Новый Структура;
		События.Вставить("ПриОкончанииРедактирования", "смартДанныеУпаковочногоЛистаПриОкончанииРедактирования");
		События.Вставить("ПослеУдаления", "смартДанныеУпаковочногоЛистаПослеУдаления");
		
		смартФормированиеИнтерфейса.СздТаблицаФормы(ЭтаФорма, 
													"смартДанныеУпаковочногоЛиста", 
													"смартГруппаДанныеУпаковочногоЛиста", 
													"Объект.смартДанныеУпаковочногоЛиста", 
													СтруктураКолонок,
													, 
													События);
													
		Элементы.смартДанныеУпаковочногоЛистаДлина.Формат = "ЧДЦ=2";
		Элементы.смартДанныеУпаковочногоЛистаШирина.Формат = "ЧДЦ=2";
		Элементы.смартДанныеУпаковочногоЛистаВысота.Формат = "ЧДЦ23";
		Элементы.смартДанныеУпаковочногоЛистаВес.Формат = "ЧДЦ=3";
		Элементы.смартДанныеУпаковочногоЛистаОбъем.Формат = "ЧДЦ=2";
													
		//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
		Элементы.смартДанныеУпаковочногоЛистаДлина.УстановитьДействие("ПриИзменении", "смартПриИзмененииГабаритовУпаковочногоЛиста");
		Элементы.смартДанныеУпаковочногоЛистаШирина.УстановитьДействие("ПриИзменении", "смартПриИзмененииГабаритовУпаковочногоЛиста");
		Элементы.смартДанныеУпаковочногоЛистаВысота.УстановитьДействие("ПриИзменении", "смартПриИзмененииГабаритовУпаковочногоЛиста");
		//-- #Б4398 смарт: Шляпников 02.10.2025
		
		//++ #Б4512 смарт: Шляпников 30.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто. Заполнение по истории
		смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартЗаполнитьУпаковочныйЛистПоПредыдущимДанным", "Заполнить по истории", "смартЗаполнитьУпаковочныйЛистПоПредыдущимДанным");
		смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартФормированиеИнтерфейса", "смартДанныеУпаковочногоЛистаКоманднаяПанель",, "смартЗаполнитьУпаковочныйЛистПоПредыдущимДанным", 1);
		//-- #Б4512 смарт: Шляпников 30.09.2025

		//++ #Б4500 смарт: Шляпников 29.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто.
		СформироватьИнфоБлокОГабаритахИВесе(Истина);
		//-- #Б4500 смарт: Шляпников 29.09.2025
		
	КонецЕсли;
	//-- #Б1140 смарт: Шляпников 02.09.2025
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура смарт_ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	#Вставка
	//++ #Б4530 смарт: Шляпников 01.10.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто. Дополнение.
	ТаблицаФормы = ПолучитьТаблицуТоваровВладельцаФормы(ВладелецФормы);
	
	Если НЕ ТаблицаФормы = Неопределено И Объект.ВидНоменклатуры = ВидНоменклатурыПлоттеры() Тогда
		
		НоменклатураИзВладельца = ПолучитьНоменклатуруИзТаблицыФормы(ТаблицаФормы);
		
		Если ЗначениеЗаполнено(НоменклатураИзВладельца) Тогда
			ЭтаФорма["смартНоменклатураПараметровВесаБрутто"] = НоменклатураИзВладельца;
			СформироватьИнфоБлокОГабаритахИВесе(Ложь, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б4530 смарт: Шляпников 01.10.2025
	#КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	#Вставка
	//++ #Б4663 смарт: Шляпников 09.10.2025 / Задания на перевозку. Заполнение поля "Вес". Серия. Дополнения.
	Если ЭтаФорма.смартДанныеУпаковочногоЛистаИзменены И ЗначениеЗаполнено(ЭтаФорма.смартНоменклатураПараметровВесаБрутто) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Владелец.ЕдиницаИзмерения
		|	И УпаковкиЕдиницыИзмерения.Вес <> &Вес
		|	И УпаковкиЕдиницыИзмерения.Высота <> &Высота
		|	И УпаковкиЕдиницыИзмерения.Глубина <> &Глубина
		|	И УпаковкиЕдиницыИзмерения.Ширина <> &Ширина
		|	И УпаковкиЕдиницыИзмерения.Объем <> &Объем";
		
		Запрос.УстановитьПараметр("Владелец", ЭтаФорма.смартНоменклатураПараметровВесаБрутто);
		Запрос.УстановитьПараметр("Вес", смартОбщегоНазначения.Строка2Число(Элементы.смартВесБруттоЗначение.Заголовок));
		Запрос.УстановитьПараметр("Высота", смартОбщегоНазначения.Строка2Число(Элементы.смартВысотаБруттоЗначение.Заголовок));
		Запрос.УстановитьПараметр("Глубина", смартОбщегоНазначения.Строка2Число(Элементы.смартДлинаБруттоЗначение.Заголовок));
		Запрос.УстановитьПараметр("Ширина", смартОбщегоНазначения.Строка2Число(Элементы.смартШиринаБруттоЗначение.Заголовок));
		Запрос.УстановитьПараметр("Объем", смартОбщегоНазначения.Строка2Число(Элементы.смартОбъемБруттоЗначение.Заголовок));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЕдиницаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЕдиницаОбъект.Вес = смартОбщегоНазначения.Строка2Число(Элементы.смартВесБруттоЗначение.Заголовок);
			ЕдиницаОбъект.Высота = смартОбщегоНазначения.Строка2Число(Элементы.смартВысотаБруттоЗначение.Заголовок);
			ЕдиницаОбъект.Глубина = смартОбщегоНазначения.Строка2Число(Элементы.смартДлинаБруттоЗначение.Заголовок);
			ЕдиницаОбъект.Ширина = смартОбщегоНазначения.Строка2Число(Элементы.смартШиринаБруттоЗначение.Заголовок);
			ЕдиницаОбъект.Объем = смартОбщегоНазначения.Строка2Число(Элементы.смартОбъемБруттоЗначение.Заголовок);
			
			ЕдиницаОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.смартДанныеУпаковочногоЛистаИзменены = Ложь;
	//-- #Б4663 смарт: Шляпников 09.10.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытияЭлементов

//++ #Б4512 смарт: Шляпников 30.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто. Заполнение по истории
&НаСервере
Процедура смартЗаполнитьУпаковочныйЛистПоПредыдущимДаннымСервер()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]) Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет данных для заполнения !");
		Возврат;
	КонецЕсли;
	
	Объект.смартДанныеУпаковочногоЛиста.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//++ #5178 смарт: Тимофеева 10.12.2025 / Дублирование ящиков в серии оборудования
	|   РАЗЛИЧНЫЕ
	//--#5178 смарт: Тимофеева 10.12.2025
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Ссылка КАК Ссылка,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.НомерСтроки КАК НомерСтроки,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.ТипУпаковки КАК ТипУпаковки,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Длина КАК Длина,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Ширина КАК Ширина,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Высота КАК Высота,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Вес КАК Вес,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Объем КАК Объем,
	|	СерииНоменклатурысмартДанныеУпаковочногоЛиста.Хрупкое КАК Хрупкое,
	|	СебестоимостьТоваров.Период КАК Период
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
	|				И АналитикаУчетаНоменклатуры.Серия <> &Серия) КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры.смартДанныеУпаковочногоЛиста КАК СерииНоменклатурысмартДанныеУпаковочногоЛиста
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Серия = СерииНоменклатурысмартДанныеУпаковочногоЛиста.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]);
	Запрос.УстановитьПараметр("Серия", Объект.Ссылка);
	
	Первая = Истина;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Первая Тогда
			ТекущаяСерия = Выборка.Ссылка;
			ТекущийПериод = Выборка.Период;
			Первая = Ложь;
		КонецЕсли;
		
		Если Выборка.Ссылка <> ТекущаяСерия ИЛИ Выборка.Период <> ТекущийПериод Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = Объект.смартДанныеУпаковочногоЛиста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

//++ #Б4512 смарт: Шляпников 30.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто. Заполнение по истории
&НаКлиенте
Процедура смартЗаполнитьУпаковочныйЛистПоПредыдущимДанным(Команда)
	смартЗаполнитьУпаковочныйЛистПоПредыдущимДаннымСервер();
КонецПроцедуры

//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
&НаКлиенте
Процедура смартПриИзмененииГабаритовУпаковочногоЛиста(Элемент)
	
	Если Элементы.смартДанныеУпаковочногоЛиста.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.смартДанныеУпаковочногоЛиста.НайтиПоИдентификатору(Элементы.смартДанныеУпаковочногоЛиста.ТекущаяСтрока);
	ТекущаяСтрока.Объем = ТекущаяСтрока.Длина * ТекущаяСтрока.Ширина * ТекущаяСтрока.Высота;
	
КонецПроцедуры

//++ #Б4663 смарт: Шляпников 09.10.2025 / Задания на перевозку. Заполнение поля "Вес". Серия. Дополнения.
&НаКлиенте
Процедура смартДанныеУпаковочногоЛистаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ЭтаФорма.смартДанныеУпаковочногоЛистаИзменены = Истина;
		СформироватьИнфоБлокОГабаритахИВесе();
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б4724 смарт: Шляпников 16.10.2025 / Задание на перевозку. Вывести суммированные показатели Объема.
&НаКлиенте
Процедура смартДанныеУпаковочногоЛистаПослеУдаления(Элемент)
	
	ЭтаФорма.смартДанныеУпаковочногоЛистаИзменены = Истина;
	СформироватьИнфоБлокОГабаритахИВесе();
		
КонецПроцедуры

#КонецОбласти

#Область Служебные

//++ #Б4500 смарт: Шляпников 29.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто.
&НаСервере
Процедура СформироватьИнфоБлокОГабаритахИВесе(Инициализировать = Ложь, ИскатьНоменклатуру = Истина)
	
	Если НЕ Объект.ВидНоменклатуры = ВидНоменклатурыПлоттеры() Тогда
		Возврат;
	КонецЕсли;
	
	Если Инициализировать Тогда
		
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаШапка",, 3, 2,,, "ГруппаШапка");
		Элементы.Переместить(Элементы.ГруппаШапка, Элементы.смартГруппаШапка);
		
		смартФормированиеИнтерфейса.СздГруппаСтраниц(ЭтаФорма, "смартСтраницыИнфоБлок", "смартГруппаШапка", 2);
		смартФормированиеИнтерфейса.СздСтраница(ЭтаФорма, "смартСтраницаГабаритыБрутто", "смартСтраницыИнфоБлок", "", 1, 2);
		Элементы.смартСтраницыИнфоБлок.ШрифтЗаголовка = Новый Шрифт(,,,,,, 0);
		
		смартФормированиеИнтерфейса.СздГруппаОбычная(ЭтаФорма, "смартГруппаГабаритыНоменклатура", "смартСтраницаГабаритыБрутто", "Параметры веса и габаритов по умолчанию", 3, 1);
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаГабаритыЛеваяКолонкаНоменклатура", "смартГруппаГабаритыНоменклатура", 1, 2);
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаГабаритыПраваяКолонкаНоменклатура", "смартГруппаГабаритыНоменклатура", 1, 1);
		Элементы.смартГруппаГабаритыЛеваяКолонкаНоменклатура.Ширина = 20;
		
		смартФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, "смартНоменклатураБрутто", "смартГруппаГабаритыЛеваяКолонкаНоменклатура", "Номенклатура:");
		
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаГабариты", "смартСтраницаГабаритыБрутто", 3, 2);
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаГабаритыЛеваяКолонка", "смартГруппаГабариты", 1, 2);
		смартФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, "смартГруппаГабаритыПраваяКолонка", "смартГруппаГабариты", 1, 2);
		Элементы.смартГруппаГабаритыЛеваяКолонка.Ширина = 20;
		Элементы.смартГруппаГабаритыЛеваяКолонка.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		Элементы.смартГруппаГабаритыПраваяКолонка.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		СвойстваЭлемента.Вставить("Заголовок", "");
		
		События = Новый Структура;
		События.Вставить("Нажатие", "НажатиесмартНоменклатураБруттоЗначение");
		
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартНоменклатураБруттоЗначение", "смартГруппаГабаритыПраваяКолонкаНоменклатура", СвойстваЭлемента, События);
		
		СвойстваЭлемента.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Право);
		СвойстваЭлемента.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Верх);
		СвойстваЭлемента.Вставить("Высота", 1);
		
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартДлинаБруттоЗначение", "смартГруппаГабаритыПраваяКолонка", СвойстваЭлемента);
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартШиринаБруттоЗначение", "смартГруппаГабаритыПраваяКолонка", СвойстваЭлемента);
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартВысотаБруттоЗначение", "смартГруппаГабаритыПраваяКолонка", СвойстваЭлемента);
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартВесБруттоЗначение", "смартГруппаГабаритыПраваяКолонка", СвойстваЭлемента);
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартПлощадьБруттоЗначение", "смартГруппаГабаритыПраваяКолонка", СвойстваЭлемента);
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартОбъемБруттоЗначение", "смартГруппаГабаритыПраваяКолонка", СвойстваЭлемента);
		
		СвойстваЭлемента.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Лево);
		СвойстваЭлемента.Вставить("Заголовок", "Длина (брутто), м:");
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартДлинаБрутто", "смартГруппаГабаритыЛеваяКолонка", СвойстваЭлемента);
		СвойстваЭлемента.Вставить("Заголовок", "Ширина (брутто), м:");
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартШиринаБрутто", "смартГруппаГабаритыЛеваяКолонка", СвойстваЭлемента);
		СвойстваЭлемента.Вставить("Заголовок", "Высота (брутто), м:");
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартВысотаБрутто", "смартГруппаГабаритыЛеваяКолонка", СвойстваЭлемента);
		СвойстваЭлемента.Вставить("Заголовок", "Вес (брутто), кг:");
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартВесБрутто", "смартГруппаГабаритыЛеваяКолонка", СвойстваЭлемента);
		СвойстваЭлемента.Вставить("Заголовок", "Площадь (брутто), м2:");
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартПлощадьБрутто", "смартГруппаГабаритыЛеваяКолонка", СвойстваЭлемента);
		СвойстваЭлемента.Вставить("Заголовок", "Объем (брутто), м3:");
		смартФормированиеИнтерфейса.СздДекорация(ЭтаФорма, "смартОбъемБрутто", "смартГруппаГабаритыЛеваяКолонка", СвойстваЭлемента);
		
		смартФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, "смартИнформацияОЯщиках", "смартСтраницаГабаритыБрутто", "");
		Элементы.смартИнформацияОЯщиках.ЦветТекста = WebЦвета.Синий;
		
	КонецЕсли;
	
	ПараметрыБрутто = ПолучитьВесовыеХарактеристикиСерииПоУмолчанию(ИскатьНоменклатуру);
	Если ПараметрыБрутто = Неопределено Тогда
		
		Элементы.смартДлинаБруттоЗначение.Заголовок = " <нет данных>";
		Элементы.смартШиринаБруттоЗначение.Заголовок = " <нет данных>";
		Элементы.смартВысотаБруттоЗначение.Заголовок = " <нет данных>";
		Элементы.смартВесБруттоЗначение.Заголовок = " <нет данных>";
		Элементы.смартПлощадьБруттоЗначение.Заголовок = " <нет данных>";
		Элементы.смартОбъемБруттоЗначение.Заголовок = " <нет данных>";
		
	Иначе
		
		Элементы.смартДлинаБруттоЗначение.Заголовок = ПараметрыБрутто.ДлинаБрутто;
		Элементы.смартШиринаБруттоЗначение.Заголовок = ПараметрыБрутто.ШиринаБрутто;
		Элементы.смартВысотаБруттоЗначение.Заголовок = ПараметрыБрутто.ВысотаБрутто;
		Элементы.смартВесБруттоЗначение.Заголовок = ПараметрыБрутто.ВесБрутто;
		Элементы.смартПлощадьБруттоЗначение.Заголовок = ПараметрыБрутто.ПлощадьБрутто;
		Элементы.смартОбъемБруттоЗначение.Заголовок = ПараметрыБрутто.ОбъемБрутто;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]) Тогда
		
		Элементы.смартНоменклатураБруттоЗначение.Гиперссылка = Истина;
		Элементы.смартНоменклатураБруттоЗначение.Заголовок = ЭтаФорма["смартНоменклатураПараметровВесаБрутто"];
		
	Иначе
		Элементы.смартНоменклатураБруттоЗначение.Заголовок = " <нет данных>";
	КонецЕсли;
	
	Если Объект.смартДанныеУпаковочногоЛиста.Количество() > 0 Тогда
		Элементы.смартИнформацияОЯщиках.Заголовок = СтрШаблон("Внимание! Количество ящиков - %1", Объект.смартДанныеУпаковочногоЛиста.Количество());
	Иначе
		Элементы.смартИнформацияОЯщиках.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

//++ #Б4500 смарт: Шляпников 29.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто.
&НаСервере
Функция ПолучитьВесовыеХарактеристикиСерииПоУмолчанию(ИскатьНоменклатуру = Истина)
	
	Если ЭтаФорма.смартДанныеУпаковочногоЛистаИзменены И Объект.смартДанныеУпаковочногоЛиста.Количество() > 0 Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ДлинаБрутто", Объект.смартДанныеУпаковочногоЛиста.Итог("Длина"));
		Результат.Вставить("ШиринаБрутто", Объект.смартДанныеУпаковочногоЛиста.Итог("Ширина"));
		Результат.Вставить("ВысотаБрутто", Объект.смартДанныеУпаковочногоЛиста.Итог("Высота"));
		Результат.Вставить("ВесБрутто", Объект.смартДанныеУпаковочногоЛиста.Итог("Вес"));
		Результат.Вставить("ПлощадьБрутто", Результат.ДлинаБрутто * Результат.ШиринаБрутто);
		Результат.Вставить("ОбъемБрутто", Объект.смартДанныеУпаковочногоЛиста.Итог("Объем"));
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИскатьНоменклатуру Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(, АналитикаУчетаНоменклатуры.Серия = &Серия) КАК СебестоимостьТоваров
		|ГДЕ
		|	СебестоимостьТоваров.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Серия", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЭтаФорма["смартНоменклатураПараметровВесаБрутто"] = Выборка.Номенклатура;
			Возврат Справочники.Номенклатура.ПолучитьДанныеБрутто(Выборка.Номенклатура);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]) Тогда
		Возврат Справочники.Номенклатура.ПолучитьДанныеБрутто(ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//++ #Б4500 смарт: Шляпников 29.09.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто.
&НаКлиенте
Процедура НажатиесмартНоменклатураБруттоЗначение(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]) Тогда
		ПоказатьЗначение(, ЭтаФорма["смартНоменклатураПараметровВесаБрутто"]);
	КонецЕсли;
	
КонецПроцедуры

//++ #Б4530 смарт: Шляпников 01.10.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто. Дополнение.
&НаКлиенте
Функция ПолучитьТаблицуТоваровВладельцаФормы(ЗНАЧ лВладелецФормы)
	
	Если лВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(лВладелецФормы) = Тип("ТаблицаФормы") Тогда
		Возврат лВладелецФормы;
	ИначеЕсли ТипЗнч(лВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат лВладелецФормы;
	Иначе
		Возврат ПолучитьТаблицуТоваровВладельцаФормы(лВладелецФормы.Родитель);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//++ #Б4530 смарт: Шляпников 01.10.2025 / Справочник Серии номенклатуры. Форма элемента. Вывод данных брутто. Дополнение.
&НаКлиенте
Функция ПолучитьНоменклатуруИзТаблицыФормы(ТаблицаФормы)
	
	Попытка
		
		Если ТипЗнч(ТаблицаФормы) = Тип("ТаблицаФормы") Тогда
			
			НоменклатураВладельца = ТаблицаФормы.ТекущиеДанные["Номенклатура"];
			Возврат НоменклатураВладельца;
			
		ИначеЕсли ТипЗнч(ТаблицаФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
			
			НоменклатураВладельца = ТаблицаФормы.Объект["Номенклатура"];
			Возврат НоменклатураВладельца;
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля "Вес". Разработка. 
&НаСервереБезКонтекста
Функция ВидНоменклатурыПлоттеры()
	
	Возврат Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	
КонецФункции

#КонецОбласти
